content/about.md
+++
title = "About Me"
author = ["Cenk Gündoğan"]
date = 2022-12-26T17:26:00+01:00
lastmod = 2024-02-23T09:55:56+01:00
draft = false
showDate = false
+++

## Moin and Servus! {#moin-and-servus}

My name is Cenk Gündoğan, and I am currently a senior researcher at the Huawei Research Center in Munich, Germany focusing on connectivity and networking solutions for Industrie 4.0 and the industrial IoT.

My previous research background is in (i) IoT connectivity and (ii) information-centric networking (ICN).
I worked as a research assistant at the [Internet Technologies](https://inet.haw-hamburg.de/) research group within the projects [I3](http://i3.realmv6.org/) and [PIVOT](https://pivot-project.info/), both funded by the Federal Ministry of Education and Research.
Supervised by [Prof. Dr. Matthias Wählisch](https://www.mi.fu-berlin.de/en/inf/groups/ilab/members/waehlisch.html) and [Prof. Dr. Thomas Schmidt](https://inet.haw-hamburg.de/members/schmidt), I obtained my doctorate (Dr. rer. nat.) from [FU Berlin](https://www.fu-berlin.de/).


## Interests {#interests}


### IETF {#ietf}

I follow these working and research groups: [6lo](https://datatracker.ietf.org/wg/6lo/), [roll](https://datatracker.ietf.org/wg/roll/), [core](https://datatracker.ietf.org/wg/core/), [lpwan](https://datatracker.ietf.org/wg/lpwan/), [detnet](https://datatracker.ietf.org/wg/detnet/), [icnrg](https://datatracker.ietf.org/rg/icnrg), [t2trg](https://datatracker.ietf.org/rg/t2trg/).
In the past, I also participated in several IETF hackathons and in previous editions of Bits-n-Bites to showcase low-power implementations of networking protocols on embedded hardware using the [RIOT](https://www.riot-os.org/) IoT operating system.


### Photography {#photography}

In 2021, I picked up photography as a creative outlet during the COVID-19 pandemic.
I use a Sony a7c full-frame mirrorless camera, and quite often my 85mm f/1.8 and 14mm f/1.8 lenses.
I shoot in RAW format and enjoy editing my shots with the open source photography workflow application [darktable](https://www.darktable.org/).


### Hiking {#hiking}

I have always enjoyed a restorative walk in the nature.
Now that I live in Munich, I started exploring hiking trails and routes in the Bavarian Alps 1-2 times per month.


## Open Source Contributions {#open-source-contributions}


### RIOT {#riot}


### Wireshark {#wireshark}
